In [1]:
import numpy as np
import pandas as pd

In [2]:
arr1 = np.random.randint(0,100,(3,4))
df1 = pd.DataFrame(arr1, columns=["a","b","c","d"])
arr2 = np.random.randint(0,100,(3,4))
df2 = pd.DataFrame(arr2, columns=["e","f","g","h"])

In [3]:
df1

    a   b   c   d
0  95  21  49  75
1  24  31  45  21
2  82  65  73  34

In [4]:
df2

    e   f   g   h
0  48  32  63  30
1  62  76  47  93
2  61  29  26  25

In [5]:
pd.concat([df1,df2])

      a     b     c     d     e     f     g     h
0  95.0  21.0  49.0  75.0   NaN   NaN   NaN   NaN
1  24.0  31.0  45.0  21.0   NaN   NaN   NaN   NaN
2  82.0  65.0  73.0  34.0   NaN   NaN   NaN   NaN
0   NaN   NaN   NaN   NaN  48.0  32.0  63.0  30.0
1   NaN   NaN   NaN   NaN  62.0  76.0  47.0  93.0
2   NaN   NaN   NaN   NaN  61.0  29.0  26.0  25.0

In [6]:
pd.concat([df1,df2],axis=1)

    a   b   c   d   e   f   g   h
0  95  21  49  75  48  32  63  30
1  24  31  45  21  62  76  47  93
2  82  65  73  34  61  29  26  25

In [7]:
df1.append(df2)

C:\Users\Admin\AppData\Local\Temp\ipykernel_2156\3062608662.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2)

      a     b     c     d     e     f     g     h
0  95.0  21.0  49.0  75.0   NaN   NaN   NaN   NaN
1  24.0  31.0  45.0  21.0   NaN   NaN   NaN   NaN
2  82.0  65.0  73.0  34.0   NaN   NaN   NaN   NaN
0   NaN   NaN   NaN   NaN  48.0  32.0  63.0  30.0
1   NaN   NaN   NaN   NaN  62.0  76.0  47.0  93.0
2   NaN   NaN   NaN   NaN  61.0  29.0  26.0  25.0

In [8]:
df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})

In [9]:
df1

     a  b
0  foo  1
1  bar  2

In [10]:
df2

     a  c
0  foo  3
1  baz  4

In [11]:
df1.merge(df2)

     a  b  c
0  foo  1  3